import UIKit

// _____________________LESSON_____________________
var greeting = "Hello, playground"

var name1 = "Alex"

name1 = "Ivan"

name1

var name2 = "Oleg"

name2 = "George"

print(name1)

print("Gasasasas")

print(name1 + " " + name2)

var colorBlue = "Blue"

// _____________________GDZ_____________________

let intNum: Int = 32

let uint32Num: UInt32 = 4294967295

let uint64Num: UInt64 = 18446744073709551615

let doubleNum: Double = 1.000000000000001

let floatNum: Float = 1.000001

var str: String

str = "Коричневое ухо фараонов"

let niggativeVar: Bool = false

// _____________________Ответик на вопросик без правил_____________________
/**
 
 Вопрос:
 Чем отличается Uint64 от Uint32?
 
 Ответ:
 Начнем с того, чем отличается UInt от Int. Тип Int является целым числом со знаком определенного размера, может быть как положительным, так и отрицательным.
 UInt в свою очередь может быть только положительным.
 UInt64 и UInt32 отличаются тем, что первый в себе содержит целое положительное число со знаком не более 64 бит (от 0 до 18446744073709551615).
 А вот UInt32, как можно догадаться, одержит целое положительное число со знаком не более 32 бит (от 0 до 4294967295).
 */
